RubyonRails/project_new/app/controllers/products_controller.rb

INSERT INTO "products" ("name", "preco", "quantidade", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "morter"], ["preco", 10.0], ["quantidade", 1], ["created_at", "2022-07-27 00:28:49.272803"], ["updated_at", "2022-07-27 00:28:49.272803"]]
---
    def create
        @product = Product.new(product_params)
        if @product.save

UPDATE "products" SET "name" = ?, "preco" = ?, "quantidade" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Leite"], ["preco", 6.0], ["quantidade", 1], ["updated_at", "2022-07-27 02:36:40.754987"], ["id", 16]]
---
    def update
        if @product.update(product_params)

DELETE FROM "products" WHERE "products"."id" = ?  [["id", 16]]
---
    def destroy
        if @product.destroy